
var isFirst = true;
chrome.runtime.onMessage.addListener(
	function(request, sender, sendResponse) {

		
/*

//pakhribash ward no: 4
		var registarNpName = [['खेत', 'कुमार', 'राई'], ['देबेन्द्र', ' ', 'गुरागाई'], ['खेत', 'कुमार', 'राई'], ['पर्शु', 'राम', 'शर्मा'], ['खेत', 'कुमार', 'राई'], ['देबेन्द्र', ' ', 'गुरागाई'], ['खेत', 'कुमार', 'राई'], ['पर्शु', 'राम', 'शर्मा'], ['खेत', 'कुमार', 'राई'], ['तारा', 'नाथ', 'लुईटेल'], ['खेत', 'कुमार', 'राई'], ['देबेन्द्र', ' ', 'गुरागाई'], ['खेत', 'कुमार', 'राई'], ['देबेन्द्र', ' ', 'गुरागाई'], ['खेत', 'कुमार', 'राई'], ['तारा', 'नाथ', 'लुईटेल'], ['खेत', 'कुमार', 'राई'], ['देबेन्द्र', ' ', 'गुरागाई'], ['खेत', 'कुमार', 'राई'], ['चन्द्र', 'बहादुर', 'भुजेल'], ['लक्ष्मण', ' ', 'स्रेष्ठ'], ['खेत', 'कुमार', 'राई'], ['देबेन्द्र', ' ', 'गुरागाई'], ['खेत', 'कुमार', 'राई'], ['लक्ष्मण', ' ', 'स्रेष्ठ'], ['खेत', 'कुमार', 'राई'], ['लक्ष्मण', ' ', 'स्रेष्ठ'], ['खेत', 'कुमार', 'राई'], ['लक्ष्मण', ' ', 'स्रेष्ठ'], ['खेत', 'कुमार', 'राई'], ['मुरमान', ' ', 'स्रेष्ठ'], ['खेत', 'कुमार', 'राई'], ['मुरमान', ' ', 'स्रेष्ठ'], ['खेत', 'कुमार', 'राई'], ['तारा', 'नाथ', 'लुईटेल'], ['खेत', 'कुमार', 'राई'], ['लक्ष्मण', ' ', 'स्रेष्ठ'], ['खेत', 'कुमार', 'राई'], ['लक्ष्मण', ' ', 'स्रेष्ठ'], ['खेत', 'कुमार', 'राई'], ['हेम', 'राज', 'अर्याल'], ['खेत', 'कुमार', 'राई'], ['खेत', 'कुमार', 'राई'], ['खेत', 'कुमार', 'राई'], ['खेत', 'कुमार', 'राई'], ['खेत', 'कुमार', 'राई'], ['लिला', 'बहादुर', 'कार्की'], ['खेत', 'कुमार', 'राई'], ['लिला', 'बहादुर', 'कार्की'], ['चित्र', 'मान', 'स्रेष्ठ'], ['खेत', 'कुमार', 'राई'], ['लिला', 'बहादुर', 'कार्की'], ['खेत', 'कुमार', 'राई'], ['लिला', 'बहादुर', 'कार्की'], ['लिला', 'बहादुर', 'कार्की'], ['मोहन', ' ', 'सुबेदी'], ['मोहन', ' ', 'सुबेदी'], ['ठगेन्द्र', ' ', 'अधिकारी'], ['ठगेन्द्र', ' ', 'अधिकारी'], ['ठगेन्द्र', ' ', 'अधिकारी'], ['राजेन्द्र', ' ', 'तामाङ'], ['संजय', ' ', 'सुबेदी']];
		var registarName =  [['Khet', 'Kumar', 'Rai'], ['Debendra', ' ', 'Guragain'], ['Khet', 'Kumar', 'Rai'], ['Parsu', 'Ram', 'Sharma'], ['Khet', 'Kumar', 'Rai'], ['Debendra', ' ', 'Guragain'], ['Khet', 'Kumar', 'Rai'], ['Parsu', 'Ram', 'Sharma', ''], ['Khet', 'Kumar', 'Rai'], ['Tara', 'nath', 'Luitel', ''], ['Khet', 'Kumar', 'Rai'], ['Debendra', ' ', 'Guragain'], ['Khet', 'Kumar', 'Rai'], ['Debendra', ' ', 'Guragain'], ['Khet', 'Kumar', 'Rai'], ['Tara', 'Nath', 'Luitel', 'nath'], ['Khet', 'Kumar', 'Rai'], ['Debendra', ' ', 'Guragain'], ['Khet', 'Kumar', 'Rai'], ['Chandra', 'Bahadur', 'Bhujel'], ['Laxman', '', 'Shrestha'], ['Khet', 'Kumar', 'Rai'], ['Debendra', ' ', 'Guragain'], ['Khet', 'Kumar', 'Rai'], ['Laxman', ' ', 'Shrestha'], ['Khet', 'Kumar', 'Rai'], ['Laxman', ' ', 'Shrestha'], ['Khet', 'Kumar', 'Rai'], ['Laxman', ' ', 'Shrestha'], ['Khet', 'Kumar', 'Rai'], ['Murman', '', 'Shrestha'], ['Khet', 'Kumar', 'Rai'], ['Murman', ' ', 'Shreatha'], ['Khet', 'Kumar', 'Rai'], ['Tara', 'Nath', 'Luitel', 'nath'], ['Khet', 'Kumar', 'Rai'], ['Laxman', ' ', 'Shrestha'], ['Khet', 'Kumar', 'Rai'], ['Laxman', ' ', 'Shrestha'], ['Khet', 'Kumar', 'Rai'], ['Hem', 'Raj', 'Aryal'], ['Khet', 'Kumar', 'Rai'], ['Khet', 'Kumar', 'Rai'], ['Khet', 'Kumar', 'Rai'], ['Khet', 'Kumar', 'Rai'], ['Khet', 'Kumar', 'Rai'], ['Lila', 'Bahadur', 'Karki'], ['Khet', 'Kumar', 'Rai'], ['Lila', 'Bahadur', 'Karki'], ['Chitra', 'man', 'Shrestha'], ['Khet', 'Kumar', 'Rai'], ['Lila', 'Bahadur', 'Karki'], ['Khet', 'Kumar', 'Rai'], ['Lila', 'Bahadur', 'Karki'], ['Lila', 'Bahadur', 'Karki'], ['Mohan', ' ', 'Subedi'], ['Mohan', ' ', 'Subedi'], ['Thangendra', ' ', 'Adhikari'], ['Thangendra', ' ', 'Adhikari'], ['Thagendra', ' ', 'Adhikari'], ['Rajendra', ' ', 'Tamang'], ['Sanjaya', ' ', 'Subedi']];
		var startDate = [[2058, 1, 2], [2061, 11, 24], [2061, 11, 27], [2061, 12, 2], [2061, 12, 6], [2061, 12, 15], [2061, 12, 29], [2062, 1, 2], [2062, 1, 11], [2062, 1, 12], [2062, 1, 18], [2062, 1, 26], [2062, 2, 2], [2062, 4, 10], [2062, 4, 30], [2062, 5, 2], [2062, 5, 27], [2062, 7, 1], [2062, 7, 3], [2062, 7, 6], [2062, 7, 24], [2062, 7, 28], [2062, 8, 14], [2062, 8, 19], [2062, 8, 27], [2062, 8, 30], [2062, 9, 1], [2062, 9, 28], [2062, 10, 2], [2062, 10, 18], [2062, 11, 11], [2062, 12, 10], [2062, 12, 20], [2062, 12, 23], [2063, 1, 15], [2063, 1, 18], [2063, 1, 22], [2063, 1, 29], [2063, 2, 8], [2063, 2, 14], [2063, 3, 6], [2063, 3, 25], [2063, 4, 2], [2063, 4, 21], [2063, 4, 28], [2063, 5, 12], [2063, 5, 19], [2063, 6, 22], [2063, 6, 30], [2063, 7, 13], [2063, 7, 20], [2063, 8, 10], [2063, 8, 22], [2067, 12, 8], [2068, 9, 11], [2070, 8, 29], [2071, 8, 22], [2074, 8, 28]];
		var endDate = [[2061, 11, 23], [2061, 11, 26], [2061, 12, 1], [2061, 12, 5], [2061, 12, 14], [2061, 12, 28], [2062, 1, 1], [2062, 1, 10], [2062, 1, 11], [2062, 1, 17], [2062, 1, 25], [2062, 2, 1], [2062, 4, 9], [2062, 4, 29], [2062, 5, 1], [2062, 5, 26], [2062, 7, 1], [2062, 7, 2], [2062, 7, 5], [2062, 7, 23], [2062, 7, 27], [2062, 8, 13], [2062, 8, 18], [2062, 8, 26], [2062, 8, 29], [2062, 9, 1], [2062, 9, 27], [2062, 10, 1], [2062, 10, 17], [2062, 11, 10], [2062, 12, 9], [2062, 12, 19], [2062, 12, 22], [2063, 1, 14], [2063, 1, 17], [2063, 1, 21], [2063, 1, 28], [2063, 2, 7], [2063, 2, 13], [2063, 3, 5], [2063, 3, 24], [2063, 4, 1], [2063, 4, 20], [2063, 4, 27], [2063, 5, 11], [2063, 5, 18], [2063, 6, 21], [2063, 6, 29], [2063, 7, 12], [2063, 7, 19], [2063, 8, 9], [2063, 8, 21], [2067, 12, 7], [2068, 9, 10], [2070, 8, 28], [2071, 8, 21], [2074, 8, 27], [2078, 1, 1]];
*/		


/*
	//ghorlikharka (5 no ward)
	
	var registarNpName = [['हेम', 'चन्द्र', 'सुबेदी'], ['देबेन्द्र', ' ', 'गुरागाई'], ['खेत', 'कुमार', 'राई'], ['देबेन्द्र', ' ', 'गुरागाई'], ['खेत', 'कुमार', 'राई'], ['पर्शु', 'राम', 'शर्मा'], ['देबेन्द्र', ' ', 'गुरागाई'], ['खेत', 'कुमार', 'राई'], ['देबेन्द्र', ' ', 'गुरागाई'], ['खेत', 'कुमार', 'राई'], ['तारा', 'नाथ', 'लुईटेल'], ['खेत', 'कुमार', 'राई'], ['तारा', 'नाथ', 'लुईटेल'], ['तारा', 'नाथ', 'लुईटेल'], ['देबेन्द्र', ' ', 'गुरागाई'], ['तारा', 'नाथ', 'लुईटेल'], ['दिपक', ' ', 'खनाल'], ['देबेन्द्र', ' ', 'गुरागाई'], ['दिपक', ' ', 'खनाल'], ['तारा', 'नाथ', 'लुईटेल'], ['देबेन्द्र', ' ', 'गुरागाई'], ['चन्द्र', ' ', 'भुजेल'], ['डम्मरू', 'बल्लभ', 'राई'], ['दिपक', ' ', 'खनाल'], ['डम्मरू', 'बल्लभ', 'राई'], ['सिता', 'राम', 'स्रेष्ठ'], ['उमेश', ' ', 'राई'], ['उमेश', ' ', 'राई'], ['राजन', 'प्रसाद', 'सुबेदी'], ['श्याम', 'बहादुर', 'देउजा']];
	
		var registarName =  [['Hem', 'Chandra', 'Subedi'], ['Debendra', ' ', 'Guragain'], ['Khet', 'Kumar', 'Rai'], ['Debendra', ' ', 'Guragain'], ['Khet', 'Kumar', 'Rai'], ['Parsu', 'Ram', 'Sharma'], ['Debendra', ' ', 'Guragain'], ['Khet', 'Kumar', 'Rai'], ['Debendra', ' ', 'Guragain'], ['Khet', 'Kumar', 'Rai'], ['Tara', 'Nath', 'Luitel'], ['Khet', 'Kumar', 'Rai'], ['Tara', 'Nath', 'Luitel'], ['Tara', 'Nath', 'Luitel'], ['Debendra', ' ', 'Guragain'], ['Tara', 'Nath', 'Luitel'], ['Dipak', ' ', 'Khanal'], ['Debendra', ' ', 'Guragain'], ['Dipak', ' ', 'Khanal'], ['Tara', 'Nath', 'Luitel'], ['Debendra', ' ', 'Guragain'], ['Chandra', ' ', 'Bhujel'], ['Dammaru', 'Ballav', 'Rai'], ['Dipak', ' ', 'Khanal'], ['Dammaru', 'Ballav', 'Rai'], ['Sita', 'Ram', 'Shrestha'], ['Umesh', ' ', 'Rai'], ['Umesh', ' ', 'Rai'], ['Rajan', 'Prasad', 'Subedi'], ['Shyam', 'Bahadur', 'Deuja']];
		
		var startDate = [[2058, 1, 25], [2061, 1, 14], [2061, 8, 14], [2061, 8, 28], [2061, 9, 25], [2061, 11, 4], [2061, 11, 17], [2061, 11, 26], [2061, 12, 4], [2062, 1, 28], [2062, 2, 8], [2062, 2, 6], [2062, 2, 30], [2062, 8, 8], [2062, 9, 20], [2062, 10, 7], [2063, 4, 28], [2063, 4, 29], [2063, 5, 6], [2063, 5, 25], [2063, 6, 26], [2063, 7, 14], [2063, 8, 11], [2063, 9, 23], [2064, 1, 7], [2064, 4, 2], [2068, 4, 3], [2068, 8, 13], [2069, 8, 26], [2071, 8, 29]];
		
		var endDate = [[2061, 1, 13], [2061, 8, 13], [2061, 8, 27], [2061, 9, 24], [2061, 11, 3], [2061, 11, 16], [2061, 11, 25], [2061, 12, 3], [2062, 1, 27], [2062, 2, 7], [2062, 2, 5], [2062, 2, 29], [2062, 8, 7], [2062, 9, 19], [2062, 10, 6], [2063, 4, 27], [2063, 4, 28], [2063, 5, 5], [2063, 5, 24], [2063, 6, 25], [2063, 7, 13], [2063, 8, 10], [2063, 9, 22], [2064, 1, 6], [2064, 4, 1], [2068, 4, 2], [2068, 8, 12], [2069, 8, 25], [2071, 8, 28], [2078, 1, 1]];
	
*/


/*
	//chumnang 10 no ward
	
	var registarNpName = [['चन्द्र', 'बाहादुर', 'राई'], ['रुद्र', 'प्रसाद', 'राई'], ['गनेश', 'प्रसाद', 'भट्टराई'], ['चन्द्र', 'बाहादुर', 'राई'], ['तारा', 'नाथ', 'लुईटेल'], ['खेत', 'कुमर', 'राई'], ['हेम', 'राज', 'अर्याल'], ['डम्मर', 'बल्लभ', 'बराल'], ['हेम', 'राज', 'अर्याल'], ['डम्मर', 'बल्लभ', 'बराल'], ['बिनोद', 'कुमार', 'थापा'], ['राम', 'प्रसाद', 'भट्टराई'], ['बिनोद', 'कुमार', 'थापा'], ['राम', 'प्रसाद', 'भट्टराई'], ['दिल', 'सेर', 'राई'], ['ज्ञानेन्द्र', 'कुमार', 'कुरुवाङ'], ['अमर', 'बहादुर', 'खत्री'], ['दिनेस', ' ', 'तिमलसिना'], ['अमर', 'बहादुर', 'खत्री'], ['भुमी', 'राज', 'ब्लोन'], ['कमला', ' ', 'पाण्डे'], ['भुमी', 'राज', 'ब्लोन'], ['कमला', ' ', 'पाण्डे']];
		var registarName =  [['Chandra', 'Bahadur', 'Rai'], ['Rudra', 'Prasad', 'Rai'], ['Ganesh', 'Prasad', 'Bhattrai'], ['Chandra', 'Bahadur', 'Rai'], ['Tara', 'Nath', 'Luitel'], ['Khet', 'Kumar', 'Rai'], ['Hem', 'Raj', 'Aryal'], ['Dammar', ' ', 'BallavBaral'], ['Hem', 'Raj', 'Aryal'], ['Dammar', 'Bahadur', 'Gurung'], ['Binod', 'Kumar', 'Thapa'], ['Ram', 'Prasad', 'Bhattrai'], ['Binod', 'Kumar', 'Thapa'], ['Ram', 'Prasad', 'Bhattrai'], ['Dil', 'Sher', 'Rai'], ['Gyanendra', 'Kumar', 'Kuruwang'], ['Amar', 'Bahadur', 'Khatri'], ['Dinesh', ' ', 'Timlasina'], ['Amar', 'Bahadur', 'Khatri'], ['Bhumi', 'Raj', 'Blon'], ['Kamala', ' ', 'Pandey'], ['Bhumi', 'Raj', 'Blon'], ['Kamala', ' ', 'Pandey']];
		var startDate = [[2058, 1, 6], [2062, 4, 32], [2062, 5, 8], [2062, 5, 12], [2063, 7, 1], [2063, 7, 2], [2063, 8, 29], [2063, 9, 16], [2063, 9, 19], [2064, 5, 19], [2066, 4, 11], [2066, 6, 19], [2066, 7, 22], [2066, 8, 7], [2069, 1, 6], [2069, 2, 28], [2071, 2, 1], [2073, 12, 8], [2073, 12, 8], [2075, 10, 25], [2076, 5, 15], [2076, 5, 15], [2076, 5, 15]];
		
		var endDate = [[2062, 4, 31], [2062, 5, 7], [2062, 5, 11], [2063, 7, 1], [2063, 7, 1], [2063, 8, 28], [2063, 9, 15], [2063, 9, 18], [2064, 5, 18], [2066, 4, 10], [2066, 6, 18], [2066, 7, 21], [2066, 8, 6], [2069, 1, 5], [2069, 2, 27], [2071, 2, 1], [2073, 12, 7], [2073, 12, 7], [2075, 10, 24], [2076, 5, 14], [2076, 5, 14], [2076, 5, 14], [2078, 1, 1]];
	


*/


/*

	//falat (6 no ward)
	
	var registarNpName = [['देबेन्द्र', ' ', 'गुरागाई'], ['बेद', 'राज', 'भट्टराई'], ['देबेन्द्र', ' ', 'गुरागाई'], ['बेद', 'राज', 'भट्टराई'], ['देबेन्द्र', ' ', 'गुरागाई'], ['बेद', 'राज', 'भट्टराई'], ['देबेन्द्र', ' ', 'गुरागाई'], ['पर्शु', 'राम', 'शर्मा'], ['खेत', 'कुमार', 'राई'], ['देबेन्द्र', ' ', 'गुरागाई'], ['खेत', 'कुमार', 'राई'], ['देबेन्द्र', ' ', 'गुरागाई'], ['खेत', 'कुमार', 'राई'], ['देबेन्द्र', ' ', 'गुरागाई'], ['तारा', 'नाथ', 'लुईटेल'], ['देबेन्द्र', ' ', 'गुरागाई'], ['तारा', 'नाथ', 'लुईटेल'], ['देबेन्द्र', ' ', 'गुरागाई'], ['तारा', 'नाथ', 'लुईटेल'], ['देबेन्द्र', ' ', 'गुरागाई'], ['तारा', 'नाथ', 'लुईटेल'], ['देबेन्द्र', ' ', 'गुरागाई'], ['काली', 'बहादुर', 'भुजेल'], ['देबेन्द्र', ' ', 'गुरागाई'], ['खेत', 'कुमार', 'राई'], ['देबेन्द्र', ' ', 'गुरागाई'], ['चन्द्र', 'बहादुर', 'भुजेल'], ['देबेन्द्र', ' ', 'गुरागाई'], ['चन्द्र', 'बहादुर', 'भुजेल'], ['देबेन्द्र', ' ', 'गुरागाई'], ['तारा', 'नाथ', 'लुईटेल'], ['देबेन्द्र', ' ', 'गुरागाई'], ['तारा', 'नाथ', 'लुईटेल'], ['लक्ष्मण', ' ', 'स्रेष्ठ'], ['तिलक', ' ', 'खत्री'], ['देबेन्द्र', ' ', 'गुरागाई'], ['चन्द्र', 'बहादुर', 'भुजेल'], ['देबेन्द्र', ' ', 'गुरागाई'], ['देबेन्द्र', ' ', 'गुरागाई'], ['भुबन', ' ', 'काफ्ले'], ['देबेन्द्र', ' ', 'गुरागाई'], ['लिला', 'बहादुर', 'कार्की'], ['सम्झना', ' ', 'कुवंर'], ['मोहन', ' ', 'सुबेदी'], ['सकुनतला', ' ', 'राई'], ['खेम', 'चन्द्र', 'वस्ती'], ['सागर', ' ', 'गौतम']];
		var registarName =  [['Debendra', ' ', 'GuraGain'], ['Bed', 'Raj', 'Bhattrai'], ['Debendra', ' ', 'GuraGain'], ['Bed', 'Raj', 'Bhattrai'], ['Debendra', ' ', 'GuraGain'], ['Bed', 'Raj', 'Bhattrai'], ['Debendra', ' ', 'GuraGain'], ['Parsu', 'Ram', 'Sharma'], ['Khet', 'Kumar', 'Rai'], ['Debendra', ' ', 'GuraGain'], ['Khet', 'Kumar', 'Rai'], ['Debendra', ' ', 'GuraGain'], ['Khet', 'Kumar', 'Rai'], ['Debendra', ' ', 'GuraGain'], ['Tara', 'Nath', 'Luitel'], ['Debendra', ' ', 'GuraGain'], ['Tara', 'Nath', 'Luitel'], ['Debendra', ' ', 'GuraGain'], ['Tara', 'Nath', 'Luitel'], ['Debendra', ' ', 'GuraGain'], ['Tara', 'Nath', 'Luitel'], ['Debendra', ' ', 'GuraGain'], ['Kali', 'Bahadur', 'Bhujel'], ['Debendra', ' ', 'GuraGain'], ['Khet', 'Kumar', 'Rai'], ['Debendra', ' ', 'GuraGain'], ['Chandra', 'Bahadur', 'Bhujel'], ['Debendra', ' ', 'GuraGain'], ['Chandra', 'Bahadur', 'Bhujel'], ['Debendra', ' ', 'GuraGain'], ['Tara', 'Nath', 'Luitel'], ['Debendra', ' ', 'GuraGain'], ['Tara', 'Nath', 'Luitel'], ['Laxman', ' ', 'Shrestha'], ['Tikal', ' ', 'Khartri'], ['Debendra', ' ', 'GuraGain'], ['Chandra', 'Bahadur', 'Bhujel'], ['Debendra', ' ', 'GuraGain'], ['Debendra', ' ', 'GuraGain'], ['Bhuwan', ' ', 'Kafle'], ['Debendra', ' ', 'GuraGain'], ['Lila', 'Bahadur', 'Karki'], ['Samjhana', ' ', 'Kuwar'], ['Mohan', ' ', 'Subedi'], ['Sakuntala', ' ', 'Rai'], ['Khem', 'Chandra', 'Wasti'], ['Sagar', ' ', 'Gautam']];
		var startDate = [[2058, 1, 2], [2061, 2, 24], [2061, 2, 24], [2061, 3, 13], [2061, 4, 13], [2061, 6, 11], [2061, 6, 19], [2061, 10, 6], [2061, 10, 24], [2061, 11, 15], [2061, 12, 19], [2062, 1, 5], [2062, 1, 25], [2062, 2, 2], [2062, 2, 24], [2062, 3, 2], [2062, 3, 14], [2062, 4, 5], [2062, 6, 5], [2062, 9, 12], [2062, 7, 4], [2062, 7, 13], [2062, 7, 24], [2062, 7, 25], [2062, 7, 29], [2062, 8, 27], [2062, 11, 24], [2062, 12, 8], [2063, 1, 19], [2063, 1, 20], [2063, 2, 30], [2063, 3, 18], [2063, 6, 3], [2063, 6, 26], [2063, 7, 9], [2063, 7, 14], [2063, 7, 19], [2063, 8, 3], [2064, 1, 18], [2070, 2, 23], [2070, 3, 2], [2070, 7, 4], [2070, 9, 7], [2071, 1, 8], [2076, 9, 9], [2075, 9, 16], [2074, 7, 21]];
		var endDate = [[2061, 2, 23], [2061, 2, 23], [2061, 3, 12], [2061, 4, 12], [2061, 6, 10], [2061, 6, 18], [2061, 10, 5], [2061, 10, 23], [2061, 11, 14], [2061, 12, 18], [2062, 1, 4], [2062, 1, 24], [2062, 2, 1], [2062, 2, 23], [2062, 3, 1], [2062, 3, 13], [2062, 4, 4], [2062, 6, 4], [2062, 9, 11], [2062, 7, 3], [2062, 7, 12], [2062, 7, 23], [2062, 7, 24], [2062, 7, 28], [2062, 8, 26], [2062, 11, 23], [2062, 12, 7], [2063, 1, 18], [2063, 1, 19], [2063, 2, 29], [2063, 3, 17], [2063, 6, 2], [2063, 6, 25], [2063, 7, 8], [2063, 7, 13], [2063, 7, 18], [2063, 8, 2], [2064, 1, 17], [2070, 2, 22], [2070, 3, 1], [2070, 7, 3], [2070, 9, 6], [2071, 1, 7], [2076, 9, 8], [2075, 9, 15], [2074, 7, 20], [2078, 1, 1]];

*/


/*

	//mugha
	
		var registarNpName = [['लक्ष्मण', ' ', 'स्रेष्ठ'], ['लिला', 'बहादुर', 'कार्की'], ['चन्द्र', 'प्रसाद', 'सुबेदी'], ['चित्र', 'मान', 'लिम्बू'], ['उगेन्द्र', ' ', 'प्रसाद'], ['राजेन्द्र', ' ', 'तामाङ'], ['नारायण', ' ', 'रायमाझी'], ['दिपेन्द्र', ' ', 'गौतम'], ['राजेन्द्र', ' ', 'तामाङ']];
		var registarName =  [['Laxman', ' ', 'Shrestha'], ['Lila', 'Bahadur', 'Karki'], ['Chandra', 'Prasad', 'Subedi'], ['Chitra', 'Man', 'Limbu'], ['Ugendra', ' ', 'Prasad'], ['Rajendra', ' ', 'Tamang'], ['Narayan', ' ', 'Rayamajhi'], ['Dipendra', ' ', 'Gautam'], ['Rajendra', ' ', 'Tamang']];
		var startDate = [[2058, 1, 12], [2066, 3, 20], [2069, 10, 26], [2070, 10, 26], [2071, 8, 17], [2073, 11, 28], [2075, 9, 10], [2076, 2, 22], [2073, 11, 28]];
		var endDate = [[2066, 3, 19], [2069, 10, 25], [2070, 10, 25], [2071, 8, 16], [2073, 11, 27], [2075, 9, 9], [2076, 2, 21], [2073, 11, 27], [2078, 1, 1]];
	
*/


		var registarNpName = [['-', '-', '-']];
		var registarName =  [['-', '-', '-']];
		//var startDate = [[2058, 1, 12], [2066, 3, 20], [2069, 10, 26], [2070, 10, 26], [2071, 8, 17], [2073, 11, 28], [2075, 9, 10], [2076, 2, 22], [2073, 11, 28]];
		var endDate = [[2078, 1, 19]];

/*


	//sanne (2 no. ward)
	
	var registarNpName = [['पर्शु', 'राम', 'शर्मा'], ['काली', 'बहादुर', 'भुजेल'], ['खेत', 'कुमार', 'राई'], ['पर्शु', 'राम', 'शर्मा'], ['देबेन्द्र', ' ', 'गुरागाई'], ['पर्शु', 'राम', 'शर्मा'], ['चन्द्र', 'बहादुर', 'भुजेल'], ['पर्शु', 'राम', 'शर्मा'], ['खेत', 'कुमार', 'राई'], ['देबेन्द्र', ' ', 'गुरागाई'], ['पर्शु', 'राम', 'शर्मा'], ['खेत', 'कुमार', 'राई'], ['पर्शु', 'राम', 'शर्मा'], ['तारा', 'नाथ', 'लुईटेल'], ['पर्शु', 'राम', 'शर्मा'], ['तारा', 'नाथ', 'लुईटेल'], ['देबेन्द्र', ' ', 'गुरागाई'], ['तारा', 'नाथ', 'लुईटेल'], ['पर्शु', 'राम', 'शर्मा'], ['तारा', 'नाथ', 'लुईटेल'], ['काली', 'बहादुर', 'भुजेल'], ['तारा', 'नाथ', 'लुईटेल'], ['देबेन्द्र', ' ', 'गुरागाई'], ['तारा', 'नाथ', 'लुईटेल'], ['देबेन्द्र', ' ', 'गुरागाई'], ['तारा', 'नाथ', 'लुईटेल'], ['हेम', 'राज', 'अर्याल'], ['खेत', 'कुमार', 'राई'], ['हेम', 'राज', 'अर्याल'], ['देबेन्द्र', ' ', 'गुरागाई'], ['हेम', 'राज', 'अर्याल'], ['तारा', 'नाथ', 'लुईटेल'], ['देबेन्द्र', ' ', 'गुरागाई'], ['हेम', 'राज', 'अर्याल'], ['तारा', 'नाथ', 'लुईटेल'], ['हेम', 'राज', 'अर्याल'], ['तारा', 'नाथ', 'लुईटेल'], ['हेम', 'राज', 'अर्याल'], ['डम्मरु', 'बल्लभ', 'बराल'], ['हेम', 'राज', 'अर्याल'], ['तारा', 'नाथ', 'लुईटेल'], ['युर', 'मान', 'स्रेष्ठ'], ['हेम', 'राज', 'अर्याल'], ['भेष', 'राज', 'दाहाल'], ['हेम', 'राज', 'अर्याल'], ['भेष', 'राज', 'दाहाल'], ['हेम', 'राज', 'अर्याल'], ['देबेन्द्र', ' ', 'गुरागाई'], ['हेम', 'राज', 'अर्याल'], ['डम्मरु', 'बल्लभ', 'बराल'], ['चन्द्र', 'बहादुर', 'भुजेल'], ['भक्त', 'बहादुर', 'भट्टराई'], ['चन्द्र', 'बहादुर', 'भुजेल'], ['खेत', 'कुमार', 'राई'], ['तिलक', ' ', 'खत्री'], ['सन्तोश', ' ', 'अधिकारी'], ['हरी', 'प्रसाद', 'गौतम'], ['उगेन्द्र', 'प्रसाद', 'अधिकारी']]
;
		var registarName =  [['Parsu', 'Ram', 'Sharma'], ['Kali', 'Bahadur', 'Bhujel'], ['Khet', 'Kumar', 'Rai'], ['Parsu', 'Ram', 'Sharma'], ['Debendra', ' ', 'Guragai'], ['Parsu', 'Ram', 'Sharma'], ['Chandra', 'Bahadur', 'Bhujel'], ['Parsu', 'Ram', 'Sharma'], ['Khet', 'Kumar', 'Rai'], ['Debendra', ' ', 'Guragai'], ['Parsu', 'Ram', 'Sharma'], ['Khet', 'Kumar', 'Rai'], ['Parsu', 'Ram', 'Sharma'], ['Tara', 'Nath', 'Luitel'], ['Parsu', 'Ram', 'Sharma'], ['Tara', 'Nath', 'Luitel'], ['Debendra', ' ', 'Guragai'], ['Tara', 'Nath', 'Luitel'], ['Parsu', 'Ram', 'Sharma'], ['Tara', 'Nath', 'Luitel'], ['Kali', 'Bahadur', 'Bhujel'], ['Tara', 'Nath', 'Luitel'], ['Debendra', ' ', 'Guragai'], ['Tara', 'Nath', 'Luitel'], ['Debendra', ' ', 'Guragai'], ['Tara', 'Nath', 'Luitel'], ['Hem', 'Raj', 'Aryal'], ['Khet', 'Kumar', 'Rai'], ['Hem', 'Raj', 'Aryal'], ['Debendra', ' ', 'Guragai'], ['Hem', 'Raj', 'Aryal'], ['Tara', 'Nath', 'Luitel'], ['Debendra', ' ', 'Guragai'], ['Hem', 'Raj', 'Aryal'], ['Tara', 'Nath', 'Luitel'], ['Hem', 'Raj', 'Aryal'], ['Tara', 'Nath', 'Luitel'], ['Hem', 'Raj', 'Aryal'], ['Dammru', 'Ballav', 'Baral'], ['Hem', 'Raj', 'Aryal'], ['Tara', 'Nath', 'Luitel'], ['Yur', 'Man', 'Shrestha'], ['Hem', 'Raj', 'Aryal'], ['Bhesh', 'Raj', 'Dahal'], ['Hem', 'Raj', 'Aryal'], ['Bhesh', 'Raj', 'Dahal'], ['Hem', 'Raj', 'Aryal'], ['Debendra', ' ', 'Guragai'], ['Hem', 'Raj', 'Aryal'], ['Dammru', 'Ballav', 'Baral'], ['Chandra', 'Bahadur', 'Bhujel'], ['Bhakta', 'Bahadur', 'Bhattrai'], ['Chandra', 'Bahadur', 'Bhujel'], ['Khet', 'Kumar', 'Rai'], ['Tilak', ' ', 'Khatri'], ['Santosh', ' ', 'Adhikari'], ['Hari', 'Prasad', 'Gautam'], ['Ugendra', 'Prasad', 'Adhikari']];
		var startDate = [[2058, 1, 2], [2061, 11, 24], [2061, 11, 27], [2061, 12, 2], [2061, 12, 6], [2061, 12, 15], [2061, 12, 29], [2062, 1, 2], [2062, 1, 11], [2062, 1, 12], [2062, 1, 18], [2062, 1, 26], [2062, 2, 2], [2062, 4, 10], [2062, 4, 30], [2062, 5, 2], [2062, 5, 27], [2062, 7, 1], [2062, 7, 3], [2062, 7, 6], [2062, 7, 24], [2062, 7, 28], [2062, 8, 14], [2062, 8, 19], [2062, 8, 27], [2062, 8, 30], [2062, 9, 1], [2062, 9, 28], [2062, 10, 2], [2062, 10, 18], [2062, 11, 11], [2062, 12, 10], [2062, 12, 20], [2062, 12, 23], [2063, 1, 15], [2063, 1, 18], [2063, 1, 22], [2063, 1, 29], [2063, 2, 8], [2063, 2, 14], [2063, 3, 6], [2063, 3, 25], [2063, 4, 2], [2063, 4, 21], [2063, 4, 28], [2063, 5, 12], [2063, 5, 19], [2063, 6, 22], [2063, 6, 30], [2063, 7, 13], [2063, 7, 20], [2063, 8, 10], [2063, 8, 22], [2067, 12, 8], [2068, 9, 11], [2070, 8, 29], [2071, 8, 22], [2074, 8, 28]];
		var endDate = [[2061, 11, 23], [2061, 11, 26], [2061, 12, 1], [2061, 12, 5], [2061, 12, 14], [2061, 12, 28], [2062, 1, 1], [2062, 1, 10], [2062, 1, 11], [2062, 1, 17], [2062, 1, 25], [2062, 2, 1], [2062, 4, 9], [2062, 4, 29], [2062, 5, 1], [2062, 5, 26], [2062, 7, 1], [2062, 7, 2], [2062, 7, 5], [2062, 7, 23], [2062, 7, 27], [2062, 8, 13], [2062, 8, 18], [2062, 8, 26], [2062, 8, 29], [2062, 9, 1], [2062, 9, 27], [2062, 10, 1], [2062, 10, 17], [2062, 11, 10], [2062, 12, 9], [2062, 12, 19], [2062, 12, 22], [2063, 1, 14], [2063, 1, 17], [2063, 1, 21], [2063, 1, 28], [2063, 2, 7], [2063, 2, 13], [2063, 3, 5], [2063, 3, 24], [2063, 4, 1], [2063, 4, 20], [2063, 4, 27], [2063, 5, 11], [2063, 5, 18], [2063, 6, 21], [2063, 6, 29], [2063, 7, 12], [2063, 7, 19], [2063, 8, 9], [2063, 8, 21], [2067, 12, 7], [2068, 9, 10], [2070, 8, 28], [2071, 8, 21], [2074, 8, 27], [2078, 1, 1]];
	

	
*/
	
		
		function isLieBetweenNew(date)
		{
			var strDate = date.split("-");
			var yy = parseInt(strDate[0]);
			var mm = parseInt(strDate[1]);
			var dd = parseInt(strDate[2]);
			for(i = 0; i<endDate.length; i++)
			{
				if(yy < endDate[i][0])
				{
					return true;
				}
				else if(yy == endDate[i][0])
				{
					if(mm < endDate[i][1])
					{
						return true;
					}
					if(mm == endDate[i][1])
					{
						if(dd <= endDate[i][2])
						{
							return true;
						}
					}
				}
			}
			return false;
		}	

	
		 
		var submitDate = document.getElementById("nepaliDate");
		var firstNameNpEnglish = document.querySelector("[name='RegistarFirstNpName']");
		var secondNameNpEnglish = document.querySelector("[name='RegistarMiddleNpName']");
		var thirdNameNpEnglish = document.querySelector("[name='RegistarLastNpName']");
		
		//var submitDate = document.getElementById("nepaliDate");
		var firstNameEnglish = document.querySelector("[name='RegistarFirstName']");
		var secondNameEnglish = document.querySelector("[name='RegistarMiddleName']");
		var thirdNameEnglish = document.querySelector("[name='RegistarLastName']");

		if(isLieBetweenNew(submitDate.value))
		{
			firstNameEnglish.value = registarName[i][0];
			secondNameEnglish.value = registarName[i][1];
			thirdNameEnglish.value = registarName[i][2];

			firstNameNpEnglish.value = registarNpName[i][0];
			secondNameNpEnglish.value = registarNpName[i][1];
			thirdNameNpEnglish.value = registarNpName[i][2];
			console.log("it is changed ", i);
		}



/*
		 var middle = document.querySelectorAll("[placeholder='Middle Name']");
		 for(i = 0; i<middle.length; i++)
		 {
		 	var middleName = middle[i].value;
		 	if(middleName.toLowerCase() == "bdr" || middleName.toLowerCase() == "bd." || middleName.toLowerCase() == "bha")
		 	{
		 		middle[i].value = "Bahadur";
		 	}
		 	
		 	if(middleName.toLowerCase() == "pd")
		 	{
		 		middle[i].value = "Prasad";
		 	}
		 	
			
		 }

*/
		 
		var submint = document.getElementsByClassName("btn blue");
		submint[0].click();

	console.log("check resutl ");
	
		
//शर्मा
	})




