var registarNpName = [['खेत', 'कुमार', 'राई'], ['देबेन्द्र', ' ', 'गुरागाई'], ['खेत', 'कुमार', 'राई'], ['पर्शु', 'राम', 'शर्मा'], ['खेत', 'कुमार', 'राई'], ['देबेन्द्र', ' ', 'गुरागाई'], ['खेत', 'कुमार', 'राई'], ['पर्शु', 'राम', 'शर्मा'], ['खेत', 'कुमार', 'राई'], ['तारा', 'नाथ', 'लुईटेल'], ['खेत', 'कुमार', 'राई'], ['देबेन्द्र', ' ', 'गुरागाई'], ['खेत', 'कुमार', 'राई'], ['देबेन्द्र', ' ', 'गुरागाई'], ['खेत', 'कुमार', 'राई'], ['तारा', 'नाथ', 'लुईटेल'], ['खेत', 'कुमार', 'राई'], ['देबेन्द्र', ' ', 'गुरागाई'], ['खेत', 'कुमार', 'राई'], ['चन्द्र', 'बहादुर', 'भुजेल'], ['लक्ष्मण', ' ', 'स्रेष्ठ'], ['खेत', 'कुमार', 'राई'], ['देबेन्द्र', ' ', 'गुरागाई'], ['खेत', 'कुमार', 'राई'], ['लक्ष्मण', ' ', 'स्रेष्ठ'], ['खेत', 'कुमार', 'राई'], ['लक्ष्मण', ' ', 'स्रेष्ठ'], ['खेत', 'कुमार', 'राई'], ['लक्ष्मण', ' ', 'स्रेष्ठ'], ['खेत', 'कुमार', 'राई'], ['मुरमान', ' ', 'स्रेष्ठ'], ['खेत', 'कुमार', 'राई'], ['मुरमान', ' ', 'स्रेष्ठ'], ['खेत', 'कुमार', 'राई'], ['तारा', 'नाथ', 'लुईटेल'], ['खेत', 'कुमार', 'राई'], ['लक्ष्मण', ' ', 'स्रेष्ठ'], ['खेत', 'कुमार', 'राई'], ['लक्ष्मण', ' ', 'स्रेष्ठ'], ['खेत', 'कुमार', 'राई'], ['हेम', 'राज', 'अर्याल'], ['खेत', 'कुमार', 'राई'], ['खेत', 'कुमार', 'राई'], ['खेत', 'कुमार', 'राई'], ['खेत', 'कुमार', 'राई'], ['खेत', 'कुमार', 'राई'], ['लिला', 'बहादुर', 'कार्की'], ['खेत', 'कुमार', 'राई'], ['लिला', 'बहादुर', 'कार्की'], ['चित्र', 'मान', 'स्रेष्ठ'], ['खेत', 'कुमार', 'राई'], ['लिला', 'बहादुर', 'कार्की'], ['खेत', 'कुमार', 'राई'], ['लिला', 'बहादुर', 'कार्की'], ['लिला', 'बहादुर', 'कार्की'], ['मोहन', ' ', 'सुबेदी'], ['मोहन', ' ', 'सुबेदी'], ['ठगेन्द्र', ' ', 'अधिकारी'], ['ठगेन्द्र', ' ', 'अधिकारी'], ['ठगेन्द्र', ' ', 'अधिकारी'], ['राजेन्द्र', ' ', 'तामाङ'], ['संजय', ' ', 'सुबेदी']];
var registarName =  [['Khet', 'Kumar', 'Rai'], ['Debendra', ' ', 'Guragain'], ['Khet', 'Kumar', 'Rai'], ['Parsu', 'Ram', 'Sharma'], ['Khet', 'Kumar', 'Rai'], ['Debendra', ' ', 'Guragain'], ['Khet', 'Kumar', 'Rai'], ['Parsu', 'Ram', 'Sharma', ''], ['Khet', 'Kumar', 'Rai'], ['Tara', 'nath', 'Luitel', ''], ['Khet', 'Kumar', 'Rai'], ['Debendra', ' ', 'Guragain'], ['Khet', 'Kumar', 'Rai'], ['Debendra', ' ', 'Guragain'], ['Khet', 'Kumar', 'Rai'], ['Tara', 'Nath', 'Luitel', 'nath'], ['Khet', 'Kumar', 'Rai'], ['Debendra', ' ', 'Guragain'], ['Khet', 'Kumar', 'Rai'], ['Chandra', 'Bahadur', 'Bhujel'], ['Laxman', '', 'Shrestha'], ['Khet', 'Kumar', 'Rai'], ['Debendra', ' ', 'Guragain'], ['Khet', 'Kumar', 'Rai'], ['Laxman', ' ', 'Shrestha'], ['Khet', 'Kumar', 'Rai'], ['Laxman', ' ', 'Shrestha'], ['Khet', 'Kumar', 'Rai'], ['Laxman', ' ', 'Shrestha'], ['Khet', 'Kumar', 'Rai'], ['Murman', '', 'Shrestha'], ['Khet', 'Kumar', 'Rai'], ['Murman', ' ', 'Shreatha'], ['Khet', 'Kumar', 'Rai'], ['Tara', 'Nath', 'Luitel', 'nath'], ['Khet', 'Kumar', 'Rai'], ['Laxman', ' ', 'Shrestha'], ['Khet', 'Kumar', 'Rai'], ['Laxman', ' ', 'Shrestha'], ['Khet', 'Kumar', 'Rai'], ['Hem', 'Raj', 'Aryal'], ['Khet', 'Kumar', 'Rai'], ['Khet', 'Kumar', 'Rai'], ['Khet', 'Kumar', 'Rai'], ['Khet', 'Kumar', 'Rai'], ['Khet', 'Kumar', 'Rai'], ['Lila', 'Bahadur', 'Karki'], ['Khet', 'Kumar', 'Rai'], ['Lila', 'Bahadur', 'Karki'], ['Chitra', 'man', 'Shrestha'], ['Khet', 'Kumar', 'Rai'], ['Lila', 'Bahadur', 'Karki'], ['Khet', 'Kumar', 'Rai'], ['Lila', 'Bahadur', 'Karki'], ['Lila', 'Bahadur', 'Karki'], ['Mohan', ' ', 'Subedi'], ['Mohan', ' ', 'Subedi'], ['Thangendra', ' ', 'Adhikari'], ['Thangendra', ' ', 'Adhikari'], ['Thagendra', ' ', 'Adhikari'], ['Rajendra', ' ', 'Tamang'], ['Sanjaya', ' ', 'Subedi']];
var startDate = [[2058, 1, 2], [2061, 11, 24], [2061, 11, 27], [2061, 12, 2], [2061, 12, 6], [2061, 12, 15], [2061, 12, 29], [2062, 1, 2], [2062, 1, 11], [2062, 1, 12], [2062, 1, 18], [2062, 1, 26], [2062, 2, 2], [2062, 4, 10], [2062, 4, 30], [2062, 5, 2], [2062, 5, 27], [2062, 7, 1], [2062, 7, 3], [2062, 7, 6], [2062, 7, 24], [2062, 7, 28], [2062, 8, 14], [2062, 8, 19], [2062, 8, 27], [2062, 8, 30], [2062, 9, 1], [2062, 9, 28], [2062, 10, 2], [2062, 10, 18], [2062, 11, 11], [2062, 12, 10], [2062, 12, 20], [2062, 12, 23], [2063, 1, 15], [2063, 1, 18], [2063, 1, 22], [2063, 1, 29], [2063, 2, 8], [2063, 2, 14], [2063, 3, 6], [2063, 3, 25], [2063, 4, 2], [2063, 4, 21], [2063, 4, 28], [2063, 5, 12], [2063, 5, 19], [2063, 6, 22], [2063, 6, 30], [2063, 7, 13], [2063, 7, 20], [2063, 8, 10], [2063, 8, 22], [2067, 12, 8], [2068, 9, 11], [2070, 8, 29], [2071, 8, 22], [2074, 8, 28]];
var endDate = [[2061, 11, 23], [2061, 11, 26], [2061, 12, 1], [2061, 12, 5], [2061, 12, 14], [2061, 12, 28], [2062, 1, 1], [2062, 1, 10], [2062, 1, 11], [2062, 1, 17], [2062, 1, 25], [2062, 2, 1], [2062, 4, 9], [2062, 4, 29], [2062, 5, 1], [2062, 5, 26], [2062, 7, 1], [2062, 7, 2], [2062, 7, 5], [2062, 7, 23], [2062, 7, 27], [2062, 8, 13], [2062, 8, 18], [2062, 8, 26], [2062, 8, 29], [2062, 9, 1], [2062, 9, 27], [2062, 10, 1], [2062, 10, 17], [2062, 11, 10], [2062, 12, 9], [2062, 12, 19], [2062, 12, 22], [2063, 1, 14], [2063, 1, 17], [2063, 1, 21], [2063, 1, 28], [2063, 2, 7], [2063, 2, 13], [2063, 3, 5], [2063, 3, 24], [2063, 4, 1], [2063, 4, 20], [2063, 4, 27], [2063, 5, 11], [2063, 5, 18], [2063, 6, 21], [2063, 6, 29], [2063, 7, 12], [2063, 7, 19], [2063, 8, 9], [2063, 8, 21], [2067, 12, 7], [2068, 9, 10], [2070, 8, 28], [2071, 8, 21], [2074, 8, 27], [2078, 1, 1]];

		function isLieBetween(date)
		{
			var strDate = date.split("-");
			var yy = parseInt(strDate[0]);
			var mm = parseInt(strDate[1]);
			var dd = parseInt(strDate[2]);

			for(j = 0; j<10; j++)
			{
				if(j == 5)
					break;
			}
			console.log(j);

			for(i = 0; i<endDate.length; i++)
			{
				if(startDate[i][0] < yy && yy < endDate[i][0])
				{
					return true;
				}
				else
				{
					if(startDate[i][0] <= yy && yy <= endDate[i][0])
					{
						if(startDate[i][1] < mm && mm < endDate[i][1])
						{
							return true;
						}
						else
						{
							if(startDate[i][1] == mm && endDate[i][1] == mm)
							{
								if(startDate[i][2] <= dd && dd <= endDate[i][2])
								{
									return true;
								}
								else
								{
									return false;
								}
							}
							else if(startDate[i][1] == mm)
							{
								return true;
							}
							else if(endDate[i][1] == mm)
							{
								if(dd <= endDate[i][2])
								{
									return true;
								}
							}
							else
							{
								return false;
							}
						}
					}
					else
					{
						return false;
					}
				}
			}
            return false;
		}

console.log(isLieBetween("2059-06-07"));